Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/qei.h
/*
 * Component description for QEI
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-07-18T20:17:01Z */
#ifndef _WBZ65_QEI_COMPONENT_H_
#define _WBZ65_QEI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR QEI                                          */
/* ************************************************************************** */

/* -------- QEI_QEICON : (QEI Offset: 0x00) (R/W 32) QEI Control Register -------- */
#define QEI_QEICON_CCM_Pos                    _UINT32_(0)                                          /* (QEI_QEICON) Counter Control Mode Selection bits Position */
#define QEI_QEICON_CCM_Msk                    (_UINT32_(0x3) << QEI_QEICON_CCM_Pos)                /* (QEI_QEICON) Counter Control Mode Selection bits Mask */
#define QEI_QEICON_CCM(value)                 (QEI_QEICON_CCM_Msk & (_UINT32_(value) << QEI_QEICON_CCM_Pos)) /* Assigment of value for CCM in the QEI_QEICON register */
#define   QEI_QEICON_CCM_INT_TMR_EXT_COUNT_Val _UINT32_(0x3)                                        /* (QEI_QEICON) Internal timer mode with optional external count enable  */
#define   QEI_QEICON_CCM_EXT_CLOCK_EXT_COUNT_Val _UINT32_(0x2)                                        /* (QEI_QEICON) External clock count with optional external count gating  */
#define   QEI_QEICON_CCM_EXT_CLK_EXT_UPDN_Val _UINT32_(0x1)                                        /* (QEI_QEICON) External clock count with external Up/Dn direction selection  */
#define   QEI_QEICON_CCM_COUNT_MODE_Val       _UINT32_(0x0)                                        /* (QEI_QEICON) Quadrature Encoder Interface Count mode (x4 mode)  */
#define QEI_QEICON_CCM_INT_TMR_EXT_COUNT      (QEI_QEICON_CCM_INT_TMR_EXT_COUNT_Val << QEI_QEICON_CCM_Pos) /* (QEI_QEICON) Internal timer mode with optional external count enable Position  */
#define QEI_QEICON_CCM_EXT_CLOCK_EXT_COUNT    (QEI_QEICON_CCM_EXT_CLOCK_EXT_COUNT_Val << QEI_QEICON_CCM_Pos) /* (QEI_QEICON) External clock count with optional external count gating Position  */
#define QEI_QEICON_CCM_EXT_CLK_EXT_UPDN       (QEI_QEICON_CCM_EXT_CLK_EXT_UPDN_Val << QEI_QEICON_CCM_Pos) /* (QEI_QEICON) External clock count with external Up/Dn direction selection Position  */
#define QEI_QEICON_CCM_COUNT_MODE             (QEI_QEICON_CCM_COUNT_MODE_Val << QEI_QEICON_CCM_Pos) /* (QEI_QEICON) Quadrature Encoder Interface Count mode (x4 mode) Position  */
#define QEI_QEICON_GATEN_Pos                  _UINT32_(2)                                          /* (QEI_QEICON) External Count Gate Enable bit Position */
#define QEI_QEICON_GATEN_Msk                  (_UINT32_(0x1) << QEI_QEICON_GATEN_Pos)              /* (QEI_QEICON) External Count Gate Enable bit Mask */
#define QEI_QEICON_GATEN(value)               (QEI_QEICON_GATEN_Msk & (_UINT32_(value) << QEI_QEICON_GATEN_Pos)) /* Assigment of value for GATEN in the QEI_QEICON register */
#define   QEI_QEICON_GATEN_ON_Val             _UINT32_(0x1)                                        /* (QEI_QEICON) External gate signal controls position counter operation  */
#define   QEI_QEICON_GATEN_OFF_Val            _UINT32_(0x0)                                        /* (QEI_QEICON) External gate signal has no affect on position counter/timer operation  */
#define QEI_QEICON_GATEN_ON                   (QEI_QEICON_GATEN_ON_Val << QEI_QEICON_GATEN_Pos)    /* (QEI_QEICON) External gate signal controls position counter operation Position  */
#define QEI_QEICON_GATEN_OFF                  (QEI_QEICON_GATEN_OFF_Val << QEI_QEICON_GATEN_Pos)   /* (QEI_QEICON) External gate signal has no affect on position counter/timer operation Position  */
#define QEI_QEICON_CNTPOL_Pos                 _UINT32_(3)                                          /* (QEI_QEICON) Position and Index Counter/Timer Direction Select bit Position */
#define QEI_QEICON_CNTPOL_Msk                 (_UINT32_(0x1) << QEI_QEICON_CNTPOL_Pos)             /* (QEI_QEICON) Position and Index Counter/Timer Direction Select bit Mask */
#define QEI_QEICON_CNTPOL(value)              (QEI_QEICON_CNTPOL_Msk & (_UINT32_(value) << QEI_QEICON_CNTPOL_Pos)) /* Assigment of value for CNTPOL in the QEI_QEICON register */
#define   QEI_QEICON_CNTPOL_NEG_Val           _UINT32_(0x1)                                        /* (QEI_QEICON) Counter direction is negative unless modified by external Up/Down signal  */
#define   QEI_QEICON_CNTPOL_POS_Val           _UINT32_(0x0)                                        /* (QEI_QEICON) Counter direction is positive unless modified by external Up/Down signal  */
#define QEI_QEICON_CNTPOL_NEG                 (QEI_QEICON_CNTPOL_NEG_Val << QEI_QEICON_CNTPOL_Pos) /* (QEI_QEICON) Counter direction is negative unless modified by external Up/Down signal Position  */
#define QEI_QEICON_CNTPOL_POS                 (QEI_QEICON_CNTPOL_POS_Val << QEI_QEICON_CNTPOL_Pos) /* (QEI_QEICON) Counter direction is positive unless modified by external Up/Down signal Position  */
#define QEI_QEICON_INTDIV_Pos                 _UINT32_(4)                                          /* (QEI_QEICON) Timer Input Clock Prescale Select bits  Position */
#define QEI_QEICON_INTDIV_Msk                 (_UINT32_(0x7) << QEI_QEICON_INTDIV_Pos)             /* (QEI_QEICON) Timer Input Clock Prescale Select bits  Mask */
#define QEI_QEICON_INTDIV(value)              (QEI_QEICON_INTDIV_Msk & (_UINT32_(value) << QEI_QEICON_INTDIV_Pos)) /* Assigment of value for INTDIV in the QEI_QEICON register */
#define   QEI_QEICON_INTDIV_1_128_Val         _UINT32_(0x7)                                        /* (QEI_QEICON) 1:128 prescale value  */
#define   QEI_QEICON_INTDIV_1_64_Val          _UINT32_(0x6)                                        /* (QEI_QEICON) 1:64 prescale value  */
#define   QEI_QEICON_INTDIV_1_32_Val          _UINT32_(0x5)                                        /* (QEI_QEICON) 1:32 prescale value  */
#define   QEI_QEICON_INTDIV_1_16_Val          _UINT32_(0x4)                                        /* (QEI_QEICON) 1:16 prescale value  */
#define   QEI_QEICON_INTDIV_1_8_Val           _UINT32_(0x3)                                        /* (QEI_QEICON) 1:8 prescale value  */
#define   QEI_QEICON_INTDIV_1_4_Val           _UINT32_(0x2)                                        /* (QEI_QEICON) 1:4 prescale value  */
#define   QEI_QEICON_INTDIV_1_2_Val           _UINT32_(0x1)                                        /* (QEI_QEICON) 1:2 prescale value  */
#define   QEI_QEICON_INTDIV_1_1_Val           _UINT32_(0x0)                                        /* (QEI_QEICON) 1:1 prescale value  */
#define QEI_QEICON_INTDIV_1_128               (QEI_QEICON_INTDIV_1_128_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:128 prescale value Position  */
#define QEI_QEICON_INTDIV_1_64                (QEI_QEICON_INTDIV_1_64_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:64 prescale value Position  */
#define QEI_QEICON_INTDIV_1_32                (QEI_QEICON_INTDIV_1_32_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:32 prescale value Position  */
#define QEI_QEICON_INTDIV_1_16                (QEI_QEICON_INTDIV_1_16_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:16 prescale value Position  */
#define QEI_QEICON_INTDIV_1_8                 (QEI_QEICON_INTDIV_1_8_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:8 prescale value Position  */
#define QEI_QEICON_INTDIV_1_4                 (QEI_QEICON_INTDIV_1_4_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:4 prescale value Position  */
#define QEI_QEICON_INTDIV_1_2                 (QEI_QEICON_INTDIV_1_2_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:2 prescale value Position  */
#define QEI_QEICON_INTDIV_1_1                 (QEI_QEICON_INTDIV_1_1_Val << QEI_QEICON_INTDIV_Pos) /* (QEI_QEICON) 1:1 prescale value Position  */
#define QEI_QEICON_IMV_Pos                    _UINT32_(8)                                          /* (QEI_QEICON) Index Match Value bits Position */
#define QEI_QEICON_IMV_Msk                    (_UINT32_(0x3) << QEI_QEICON_IMV_Pos)                /* (QEI_QEICON) Index Match Value bits Mask */
#define QEI_QEICON_IMV(value)                 (QEI_QEICON_IMV_Msk & (_UINT32_(value) << QEI_QEICON_IMV_Pos)) /* Assigment of value for IMV in the QEI_QEICON register */
#define   QEI_QEICON_IMV_B1_A1_Val            _UINT32_(0x3)                                        /* (QEI_QEICON) Index match occurs when QEB is 1 and QEA is 1  */
#define   QEI_QEICON_IMV_B1_A0_Val            _UINT32_(0x2)                                        /* (QEI_QEICON) Index match occurs when QEB is 1 and QEA is 0  */
#define   QEI_QEICON_IMV_B0_A1_Val            _UINT32_(0x1)                                        /* (QEI_QEICON) Index match occurs when QEB is 0 and QEA is 1  */
#define   QEI_QEICON_IMV_B0_A0_Val            _UINT32_(0x0)                                        /* (QEI_QEICON) Index match occurs when QEB is 0 and QEA is 0  */
#define QEI_QEICON_IMV_B1_A1                  (QEI_QEICON_IMV_B1_A1_Val << QEI_QEICON_IMV_Pos)     /* (QEI_QEICON) Index match occurs when QEB is 1 and QEA is 1 Position  */
#define QEI_QEICON_IMV_B1_A0                  (QEI_QEICON_IMV_B1_A0_Val << QEI_QEICON_IMV_Pos)     /* (QEI_QEICON) Index match occurs when QEB is 1 and QEA is 0 Position  */
#define QEI_QEICON_IMV_B0_A1                  (QEI_QEICON_IMV_B0_A1_Val << QEI_QEICON_IMV_Pos)     /* (QEI_QEICON) Index match occurs when QEB is 0 and QEA is 1 Position  */
#define QEI_QEICON_IMV_B0_A0                  (QEI_QEICON_IMV_B0_A0_Val << QEI_QEICON_IMV_Pos)     /* (QEI_QEICON) Index match occurs when QEB is 0 and QEA is 0 Position  */
#define QEI_QEICON_PIMOD_Pos                  _UINT32_(10)                                         /* (QEI_QEICON) Position Counter Initialization Mode Select bits Position */
#define QEI_QEICON_PIMOD_Msk                  (_UINT32_(0x7) << QEI_QEICON_PIMOD_Pos)              /* (QEI_QEICON) Position Counter Initialization Mode Select bits Mask */
#define QEI_QEICON_PIMOD(value)               (QEI_QEICON_PIMOD_Msk & (_UINT32_(value) << QEI_QEICON_PIMOD_Pos)) /* Assigment of value for PIMOD in the QEI_QEICON register */
#define   QEI_QEICON_PIMOD_7_Val              _UINT32_(0x7)                                        /* (QEI_QEICON) Modulo Count mode for position counter and every index event resets the position counter  */
#define   QEI_QEICON_PIMOD_6_Val              _UINT32_(0x6)                                        /* (QEI_QEICON) Modulo Count mode for position counter  */
#define   QEI_QEICON_PIMOD_5_Val              _UINT32_(0x5)                                        /* (QEI_QEICON) Resets the position counter when the position counter equals QEIICCH register  */
#define   QEI_QEICON_PIMOD_4_Val              _UINT32_(0x4)                                        /* (QEI_QEICON) Second index event after home event initializes position counter with contents of QEIICCHregister  */
#define   QEI_QEICON_PIMOD_3_Val              _UINT32_(0x3)                                        /* (QEI_QEICON) First index event after home event initializes position counter with contents of QEIICCH register  */
#define   QEI_QEICON_PIMOD_2_Val              _UINT32_(0x2)                                        /* (QEI_QEICON) Next index input event initializes the position counter with contents of QEIICCH register  */
#define   QEI_QEICON_PIMOD_1_Val              _UINT32_(0x1)                                        /* (QEI_QEICON) Every Index input event resets the position counter  */
#define   QEI_QEICON_PIMOD_0_Val              _UINT32_(0x0)                                        /* (QEI_QEICON) Index input event does not affect position counter  */
#define QEI_QEICON_PIMOD_7                    (QEI_QEICON_PIMOD_7_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Modulo Count mode for position counter and every index event resets the position counter Position  */
#define QEI_QEICON_PIMOD_6                    (QEI_QEICON_PIMOD_6_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Modulo Count mode for position counter Position  */
#define QEI_QEICON_PIMOD_5                    (QEI_QEICON_PIMOD_5_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Resets the position counter when the position counter equals QEIICCH register Position  */
#define QEI_QEICON_PIMOD_4                    (QEI_QEICON_PIMOD_4_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Second index event after home event initializes position counter with contents of QEIICCHregister Position  */
#define QEI_QEICON_PIMOD_3                    (QEI_QEICON_PIMOD_3_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) First index event after home event initializes position counter with contents of QEIICCH register Position  */
#define QEI_QEICON_PIMOD_2                    (QEI_QEICON_PIMOD_2_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Next index input event initializes the position counter with contents of QEIICCH register Position  */
#define QEI_QEICON_PIMOD_1                    (QEI_QEICON_PIMOD_1_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Every Index input event resets the position counter Position  */
#define QEI_QEICON_PIMOD_0                    (QEI_QEICON_PIMOD_0_Val << QEI_QEICON_PIMOD_Pos)     /* (QEI_QEICON) Index input event does not affect position counter Position  */
#define QEI_QEICON_QEISIDL_Pos                _UINT32_(13)                                         /* (QEI_QEICON) Stop in Idle Mode bit Position */
#define QEI_QEICON_QEISIDL_Msk                (_UINT32_(0x1) << QEI_QEICON_QEISIDL_Pos)            /* (QEI_QEICON) Stop in Idle Mode bit Mask */
#define QEI_QEICON_QEISIDL(value)             (QEI_QEICON_QEISIDL_Msk & (_UINT32_(value) << QEI_QEICON_QEISIDL_Pos)) /* Assigment of value for QEISIDL in the QEI_QEICON register */
#define   QEI_QEICON_QEISIDL_DISCONT_Val      _UINT32_(0x1)                                        /* (QEI_QEICON) Discontinue module operation when device enters Idle mode  */
#define   QEI_QEICON_QEISIDL_CONT_Val         _UINT32_(0x0)                                        /* (QEI_QEICON) Continue module operation in Idle mode  */
#define QEI_QEICON_QEISIDL_DISCONT            (QEI_QEICON_QEISIDL_DISCONT_Val << QEI_QEICON_QEISIDL_Pos) /* (QEI_QEICON) Discontinue module operation when device enters Idle mode Position  */
#define QEI_QEICON_QEISIDL_CONT               (QEI_QEICON_QEISIDL_CONT_Val << QEI_QEICON_QEISIDL_Pos) /* (QEI_QEICON) Continue module operation in Idle mode Position  */
#define QEI_QEICON_ON_Pos                     _UINT32_(15)                                         /* (QEI_QEICON) Quadrature Encoder Interface Module Counter Enable bit Position */
#define QEI_QEICON_ON_Msk                     (_UINT32_(0x1) << QEI_QEICON_ON_Pos)                 /* (QEI_QEICON) Quadrature Encoder Interface Module Counter Enable bit Mask */
#define QEI_QEICON_ON(value)                  (QEI_QEICON_ON_Msk & (_UINT32_(value) << QEI_QEICON_ON_Pos)) /* Assigment of value for ON in the QEI_QEICON register */
#define   QEI_QEICON_ON_ON_Val                _UINT32_(0x1)                                        /* (QEI_QEICON) Module counters are enabled  */
#define   QEI_QEICON_ON_OFF_Val               _UINT32_(0x0)                                        /* (QEI_QEICON) Module counters are disabled  */
#define QEI_QEICON_ON_ON                      (QEI_QEICON_ON_ON_Val << QEI_QEICON_ON_Pos)          /* (QEI_QEICON) Module counters are enabled Position  */
#define QEI_QEICON_ON_OFF                     (QEI_QEICON_ON_OFF_Val << QEI_QEICON_ON_Pos)         /* (QEI_QEICON) Module counters are disabled Position  */
#define QEI_QEICON_Msk                        _UINT32_(0x0000BF7F)                                 /* (QEI_QEICON) Register Mask  */


/* -------- QEI_QEICONCLR : (QEI Offset: 0x04) (R/W 32) Bit clear register -------- */
#define QEI_QEICONCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEICONCLR) Bit clear register  Reset Value */

#define QEI_QEICONCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEICONCLR) Register Mask  */


