Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/qei.h
/* -------- QEI_VELHLD : (QEI Offset: 0x60) (R/W 32) Velocity Counter Holding Register -------- */
#define QEI_VELHLD_VELHLD_Pos                 _UINT32_(0)                                          /* (QEI_VELHLD) Velocity Cout Hold Position */
#define QEI_VELHLD_VELHLD_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_VELHLD_VELHLD_Pos)      /* (QEI_VELHLD) Velocity Cout Hold Mask */
#define QEI_VELHLD_VELHLD(value)              (QEI_VELHLD_VELHLD_Msk & (_UINT32_(value) << QEI_VELHLD_VELHLD_Pos)) /* Assigment of value for VELHLD in the QEI_VELHLD register */
#define QEI_VELHLD_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_VELHLD) Register Mask  */


/* -------- QEI_VELHLDCLR : (QEI Offset: 0x64) (R/W 32) Bit clear register -------- */
#define QEI_VELHLDCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELHLDCLR) Bit clear register  Reset Value */

#define QEI_VELHLDCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELHLDCLR) Register Mask  */


/* -------- QEI_VELHLDSET : (QEI Offset: 0x68) (R/W 32) Bit set register -------- */
#define QEI_VELHLDSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELHLDSET) Bit set register  Reset Value */

#define QEI_VELHLDSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELHLDSET) Register Mask  */


/* -------- QEI_VELHLDINV : (QEI Offset: 0x6C) (R/W 32) Bit invert register -------- */
#define QEI_VELHLDINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELHLDINV) Bit invert register  Reset Value */

#define QEI_VELHLDINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELHLDINV) Register Mask  */


/* -------- QEI_INTTMR : (QEI Offset: 0x70) (R/W 32) Interval Timer Register -------- */
#define QEI_INTTMR_INTTMR_Pos                 _UINT32_(0)                                          /* (QEI_INTTMR) Interval Timer Position */
#define QEI_INTTMR_INTTMR_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_INTTMR_INTTMR_Pos)      /* (QEI_INTTMR) Interval Timer Mask */
#define QEI_INTTMR_INTTMR(value)              (QEI_INTTMR_INTTMR_Msk & (_UINT32_(value) << QEI_INTTMR_INTTMR_Pos)) /* Assigment of value for INTTMR in the QEI_INTTMR register */
#define QEI_INTTMR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_INTTMR) Register Mask  */


/* -------- QEI_INTTMRCLR : (QEI Offset: 0x74) (R/W 32) Bit clear register -------- */
#define QEI_INTTMRCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTTMRCLR) Bit clear register  Reset Value */

#define QEI_INTTMRCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTTMRCLR) Register Mask  */


/* -------- QEI_INTTMRSET : (QEI Offset: 0x78) (R/W 32) Bit set register -------- */
#define QEI_INTTMRSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTTMRSET) Bit set register  Reset Value */

#define QEI_INTTMRSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTTMRSET) Register Mask  */


/* -------- QEI_INTTMRINV : (QEI Offset: 0x7C) (R/W 32) Bit invert register -------- */
#define QEI_INTTMRINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTTMRINV) Bit invert register  Reset Value */

#define QEI_INTTMRINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTTMRINV) Register Mask  */


/* -------- QEI_INTHLD : (QEI Offset: 0x80) (R/W 32) Interval Timer Holding Register -------- */
#define QEI_INTHLD_INTHLD_Pos                 _UINT32_(0)                                          /* (QEI_INTHLD) Interval Count Hold Position */
#define QEI_INTHLD_INTHLD_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_INTHLD_INTHLD_Pos)      /* (QEI_INTHLD) Interval Count Hold Mask */
#define QEI_INTHLD_INTHLD(value)              (QEI_INTHLD_INTHLD_Msk & (_UINT32_(value) << QEI_INTHLD_INTHLD_Pos)) /* Assigment of value for INTHLD in the QEI_INTHLD register */
#define QEI_INTHLD_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_INTHLD) Register Mask  */


/* -------- QEI_INTHLDCLR : (QEI Offset: 0x84) (R/W 32) Bit clear register -------- */
#define QEI_INTHLDCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTHLDCLR) Bit clear register  Reset Value */

#define QEI_INTHLDCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTHLDCLR) Register Mask  */


/* -------- QEI_INTHLDSET : (QEI Offset: 0x88) (R/W 32) Bit set register -------- */
#define QEI_INTHLDSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTHLDSET) Bit set register  Reset Value */

#define QEI_INTHLDSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTHLDSET) Register Mask  */


/* -------- QEI_INTHLDINV : (QEI Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define QEI_INTHLDINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_INTHLDINV) Bit invert register  Reset Value */

#define QEI_INTHLDINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_INTHLDINV) Register Mask  */


/* -------- QEI_INDXCNT : (QEI Offset: 0x90) (R/W 32) Index Counter Register -------- */
#define QEI_INDXCNT_INDXCNT_Pos               _UINT32_(0)                                          /* (QEI_INDXCNT) Index Counter Position */
#define QEI_INDXCNT_INDXCNT_Msk               (_UINT32_(0xFFFFFFFF) << QEI_INDXCNT_INDXCNT_Pos)    /* (QEI_INDXCNT) Index Counter Mask */
#define QEI_INDXCNT_INDXCNT(value)            (QEI_INDXCNT_INDXCNT_Msk & (_UINT32_(value) << QEI_INDXCNT_INDXCNT_Pos)) /* Assigment of value for INDXCNT in the QEI_INDXCNT register */
#define QEI_INDXCNT_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (QEI_INDXCNT) Register Mask  */


/* -------- QEI_INDXCNTCLR : (QEI Offset: 0x94) (R/W 32) Bit clear register -------- */
#define QEI_INDXCNTCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXCNTCLR) Bit clear register  Reset Value */

#define QEI_INDXCNTCLR_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXCNTCLR) Register Mask  */


/* -------- QEI_INDXCNTSET : (QEI Offset: 0x98) (R/W 32) Bit set register -------- */
#define QEI_INDXCNTSET_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXCNTSET) Bit set register  Reset Value */

#define QEI_INDXCNTSET_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXCNTSET) Register Mask  */


/* -------- QEI_INDXCNTINV : (QEI Offset: 0x9C) (R/W 32) Bit invert register -------- */
#define QEI_INDXCNTINV_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXCNTINV) Bit invert register  Reset Value */

#define QEI_INDXCNTINV_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXCNTINV) Register Mask  */


/* -------- QEI_INDXHLD : (QEI Offset: 0xA0) (R/W 32) Index Counter Holding Register -------- */
#define QEI_INDXHLD_INDXHLD_Pos               _UINT32_(0)                                          /* (QEI_INDXHLD) Index Count Hold Position */
#define QEI_INDXHLD_INDXHLD_Msk               (_UINT32_(0xFFFFFFFF) << QEI_INDXHLD_INDXHLD_Pos)    /* (QEI_INDXHLD) Index Count Hold Mask */
#define QEI_INDXHLD_INDXHLD(value)            (QEI_INDXHLD_INDXHLD_Msk & (_UINT32_(value) << QEI_INDXHLD_INDXHLD_Pos)) /* Assigment of value for INDXHLD in the QEI_INDXHLD register */
#define QEI_INDXHLD_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (QEI_INDXHLD) Register Mask  */


/* -------- QEI_INDXHLDCLR : (QEI Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define QEI_INDXHLDCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXHLDCLR) Bit clear register  Reset Value */

#define QEI_INDXHLDCLR_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXHLDCLR) Register Mask  */


/* -------- QEI_INDXHLDSET : (QEI Offset: 0xA8) (R/W 32) Bit set register -------- */
#define QEI_INDXHLDSET_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXHLDSET) Bit set register  Reset Value */

#define QEI_INDXHLDSET_Msk                    _UINT32_(0x00000000)                                 /* (QEI_INDXHLDSET) Register Mask  */


/* -------- QEI_INDXHLDINV : (QEI Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define QEI_INDXHLDINV_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_INDXHLDINV) Bit invert register  Reset Value */

