Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_udp_server/src/packs/WBZ653_DFP/component/qei.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief QEI register API structure */
typedef struct
{
  __IO  uint32_t                       QEI_QEICON;         /**< Offset: 0x00 (R/W  32) QEI Control Register */
  __IO  uint32_t                       QEI_QEICONCLR;      /**< Offset: 0x04 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_QEICONSET;      /**< Offset: 0x08 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_QEICONINV;      /**< Offset: 0x0C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_QEIIOC;         /**< Offset: 0x10 (R/W  32) QEI I/O Control Register */
  __IO  uint32_t                       QEI_QQEIIOCCLR;     /**< Offset: 0x14 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_QEIIOCSET;      /**< Offset: 0x18 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_QEIIOCINV;      /**< Offset: 0x1C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_QEISTAT;        /**< Offset: 0x20 (R/W  32) QEI Status Register */
  __IO  uint32_t                       QEI_QEISTATCLR;     /**< Offset: 0x24 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_QEISTATSET;     /**< Offset: 0x28 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_QEISTATINV;     /**< Offset: 0x2C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_POSCNT;         /**< Offset: 0x30 (R/W  32) Position Counter Register */
  __IO  uint32_t                       QEI_POSCNTCLR;      /**< Offset: 0x34 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_POSCNTSET;      /**< Offset: 0x38 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_POSCNTINV;      /**< Offset: 0x3C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_POSHLD;         /**< Offset: 0x40 (R/W  32) Position Count Hold Register */
  __IO  uint32_t                       QEI_POSHLDCLR;      /**< Offset: 0x44 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_POSHLDSET;      /**< Offset: 0x48 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_POSHLDINV;      /**< Offset: 0x4C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_VELCNT;         /**< Offset: 0x50 (R/W  32) Velocity Counter Register */
  __IO  uint32_t                       QEI_VELCNTCLR;      /**< Offset: 0x54 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_VELCNTSET;      /**< Offset: 0x58 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_VELCNTINV;      /**< Offset: 0x5C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_VELHLD;         /**< Offset: 0x60 (R/W  32) Velocity Counter Holding Register */
  __IO  uint32_t                       QEI_VELHLDCLR;      /**< Offset: 0x64 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_VELHLDSET;      /**< Offset: 0x68 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_VELHLDINV;      /**< Offset: 0x6C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_INTTMR;         /**< Offset: 0x70 (R/W  32) Interval Timer Register */
  __IO  uint32_t                       QEI_INTTMRCLR;      /**< Offset: 0x74 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_INTTMRSET;      /**< Offset: 0x78 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_INTTMRINV;      /**< Offset: 0x7C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_INTHLD;         /**< Offset: 0x80 (R/W  32) Interval Timer Holding Register */
  __IO  uint32_t                       QEI_INTHLDCLR;      /**< Offset: 0x84 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_INTHLDSET;      /**< Offset: 0x88 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_INTHLDINV;      /**< Offset: 0x8C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_INDXCNT;        /**< Offset: 0x90 (R/W  32) Index Counter Register */
  __IO  uint32_t                       QEI_INDXCNTCLR;     /**< Offset: 0x94 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_INDXCNTSET;     /**< Offset: 0x98 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_INDXCNTINV;     /**< Offset: 0x9C (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_INDXHLD;        /**< Offset: 0xA0 (R/W  32) Index Counter Holding Register */
  __IO  uint32_t                       QEI_INDXHLDCLR;     /**< Offset: 0xA4 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_INDXHLDSET;     /**< Offset: 0xA8 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_INDXHLDINV;     /**< Offset: 0xAC (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_QEIICC;         /**< Offset: 0xB0 (R/W  32) QEI Initialize/Capture/Compare Register */
  __IO  uint32_t                       QEI_QEIICCCLR;      /**< Offset: 0xB4 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_QEIICCSET;      /**< Offset: 0xB8 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_QEIICCINV;      /**< Offset: 0xBC (R/W  32) Bit invert register */
  __IO  uint32_t                       QEI_QEICMPL;        /**< Offset: 0xC0 (R/W  32) Capture Low Register */
  __IO  uint32_t                       QEI_QEICMPLCLR;     /**< Offset: 0xC4 (R/W  32) Bit clear register */
  __IO  uint32_t                       QEI_QEICMPLSET;     /**< Offset: 0xC8 (R/W  32) Bit set register */
  __IO  uint32_t                       QEI_QEICMPLINV;     /**< Offset: 0xCC (R/W  32) Bit invert register */
} qei_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_QEI_COMPONENT_H_ */
